app/controllers/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
	def getAllApplications
		@applications = Application.all

INSERT INTO `applications` (`token`, `name`, `chats_count`, `created_at`, `updated_at`) VALUES ('VAjwup5Rd4KpbYWJ9TQmxjk4', 'TestApp', 0, '2022-04-19 14:44:03.889916', '2022-04-19 14:44:03.889916')
---
	def createApplication
		@appName = params['Name']
		if !@appName.blank?
			@newApplication = Application.new({name:@appName.strip}) #Trim leading and trailing white spaces
			if @newApplication.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'Y6vr8Xo8Ws65S1ztuLTPiekt' LIMIT 1
---
	def getAppByToken
		@token = params[:token]
		@application = Application.find_by token: @token