app/controllers/chats_controller.rb

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'Y6vr8Xo8Ws65S1ztuLTPiekt' LIMIT 1
SELECT MAX(number) FROM `chats` GROUP BY `chats`.`application_id` HAVING (application_id=1)
SELECT `chats`.* FROM `chats`
SELECT 1 AS one FROM `chats` GROUP BY `chats`.`application_id` HAVING (application_id=1) LIMIT 1
INSERT INTO `chats` (`application_id`, `messages_count`, `created_at`, `updated_at`, `number`) VALUES (1, 0, '2022-04-23 02:34:33.421815', '2022-04-23 02:34:33.421815', 3)
---
    def createChat
        @token = params[:token]
		@application = Application.find_by token: @token
        #If no application with this token is found
        if @application.nil?
			render json: {error: "Can't find application with this token."}, status:400
        else
            @lastChat = Chat.select('MAX(number)').group(:application_id).having('application_id=' + (@application.id).to_s)
            #If first chat to be inserted start numbering from 1
            if @lastChat.empty?
                @number = 1
            else
                @number = @lastChat[0]['MAX(number)'] + 1
            end
            @newChat = Chat.new(application_id: @application.id, number: @number)
            @application.update(chats_count: @application.chats_count + 1)
            if @newChat.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'qASiAM6P6F2HvUmLMwmqe7EP' LIMIT 1
SELECT `applications`.* FROM `applications` WHERE `applications`.`application_id` = 1 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE (application_id = 1)
SELECT 1 AS one FROM `chats` WHERE (application_id = 1) LIMIT 1
---
    def getAllChats
        @token = params[:token]
        @application = Application.find_by token: @token
        if @application.nil?
            render json: {error: "Invalid application token"}
        else
            @chats = Chat.where("application_id = #{@application.id}")
            if @chats.empty?