app/controllers/messages_controller.rb

    def getMessagesOfChat
        @chatNumber = params[:chatNumber]
        @messages = Message.joins("INNER JOIN chats ON chats.id = messages.chat_id and chats.number = #{@chatNumber}")
        if !@messages.empty?
---
SELECT `messages`.* FROM `messages` INNER JOIN chats ON chats.id = messages.chat_id and chats.number = 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`number` = 1 LIMIT 1
SELECT 1 AS one FROM `messages` INNER JOIN chats ON chats.id = messages.chat_id and chats.number = hh14rkDCY1LTwDmcEVrBoGvs LIMIT 1
SELECT `messages`.* FROM `messages` WHERE (chat_id = 1)

    def createMessage
        @applicationToken = params[:token], @chatNumber = params[:chatNumber], @messageBody = request.params['MessageBody']
        @application = Application.find_by(token: @applicationToken)
        if @application.nil?
            render json: {error: 'Token is invalid'}
        end
        @chat = Chat.find_by(application_id: @application.id, number: @chatNumber)
        #If chat number is not correct
        if @chat.nil?
            render json: {error: 'Chat number is not correct, no chat found'}, status:400
        else
            if !@messageBody.blank?
                #Get last message number in this chat
                @lastMessage = Message.select('MAX(number)').group(:chat_id).having('chat_id=' + (@chat.id).to_s)
                #If first message to be inserted start numbering from 1
                if @lastMessage.empty?
                    @number = 1
                else
                    @number = @lastMessage[0]['MAX(number)'] + 1
                end
                #Create new Message Object
                @newMessage = Message.new(chat_id: @chat.id, message_body: @messageBody.strip, number: @number) #Trim leading and trailing white spaces
                #Save the message and update messages count in Chat table
                if @newMessage.save
                    @chat.update(messages_count: @chat.messages_count+1)
---
SELECT `applications`.* FROM `applications` WHERE (`applications`.`token` IN ('hh14rkDCY1LTwDmcEVrBoGvs', '1') OR `applications`.`token` IS NULL) LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2 AND `chats`.`number` = 1 LIMIT 1
SELECT `messages`.`number` FROM `messages` WHERE `messages`.`chat_id` = 4
SELECT MAX(number) FROM `messages` GROUP BY `messages`.`chat_id` HAVING (chat_id=4)
SELECT `messages`.* FROM `messages` ORDER BY `messages`.`id` DESC LIMIT 1
SELECT 1 AS one FROM `messages` GROUP BY `messages`.`chat_id` HAVING (chat_id=6) LIMIT 1
INSERT INTO `messages` (`chat_id`, `message_body`, `created_at`, `updated_at`, `number`) VALUES (6, 'HELLO WORLD', '2022-04-23 04:01:00.693185', '2022-04-23 04:01:00.693185', 1)
UPDATE `chats` SET `chats`.`messages_count` = 1, `chats`.`updated_at` = '2022-04-23 04:01:00.829149' WHERE `chats`.`id` = 6